[
  {"id": "q1", "q": "How many people accompanied Ibrahim (alayhis salam) during the Hijra from Mesopotamia to Palestine?", "a": ["Nobody", "One person", "Two people", "Group of people"], "c": 2},
  {"id": "q2", "q": "From the hadith: “The inhabitants of Paradise will have a comb made of gold, and the incense burner will contain...” What will be in the smoking room?", "a": ["Musk", "Oud", "Mirra", "Chanel No. 5"], "c": 1},
  {"id": "q3", "q": "Which month is the best, and which month has the best day?", "a": ["Ramadan, Shawwal", "Dhul-Hijjah, Ramadan", "Ramadan, Muharram", "Ramadan, Dhul-Hijjah"], "c": 3},
  {"id": "q4", "q": "From the hadith: Jibril (alayhis salam) commanded the Prophet ﷺ to pray in the valley, which is sacred to Allah. What is it called?", "a": ["Bukhtan", "Buthan", "Mina", "Muzdalifa"], "c": 1},
  {"id": "q5", "q": "What is tawassul in Islam?", "a": ["Ways to get closer to Allah", "A place in heaven for one person", "Condition for borrowing money", "Visit to the fortune teller"], "c": 0},
  {"id": "q6", "q": "From the hadith: \"Buthan is one of the rivers of Paradise.\" Where is the valley of Buthan on earth?", "a": ["In Mecca", "In Medina", "Between Mecca and Taif", "Between Medina and Mecca"], "c": 1},
  {"id": "q7", "q": "According to the majority of scholars, is the basmallah an ayah of Surah Al-Fatiha?", "a": ["No", "Yes", "There is no such surah", "It is part of all surahs of the Qur'an"], "c": 0},
  {"id": "q8", "q": "Which surah in the Qur'an does not begin with the basmallah?", "a": ["\"Al-Ikhlas\"", "\"Al-Fatiha\"", "\"At-Tauba\"", "\"Al-Mulk\""], "c": 2},
  {"id": "q9", "q": "In which year of the Hijri was fasting prescribed?", "a": ["In the 4th year", "In the 3rd year", "In the 2nd year", "In the 1st year"], "c": 2},
  {"id": "q10", "q": "Itikaf is seclusion for worship in a mosque. Where is it performed (minimum condition)?", "a": ["In any mosque", "Only in a mosque where Juma prayer is held", "On the roof of your house", "All options are suitable"], "c": 0},
  {"id": "q11", "q": "Complete the hadith: “The smell coming from the mouth of a fasting person is better with Allah than the aroma of...”?", "a": ["Raihana", "Uda", "musk", "Ambergris"], "c": 2},
  {"id": "q12", "q": "Which of the following was the scribe of the Prophet ﷺ?", "a": ["Yazid ibn Abu Sufyan", "Ibn Abbas", "Zayd ibn Harisa", "Mu'awiyah ibn Abu Sufyan"], "c": 3},
  {"id": "q13", "q": "What is al-mu'awwidhatayn?", "a": ["The last three suras of the Qur'an", "The last two suras of the Qur'an (Al-Falak and An-Nas)", "Surah Al-Falak", "Surah An-Nas"], "c": 1},
  {"id": "q14", "q": "Which of the scribes of the Prophet ﷺ did Abu Bakr al-Siddiq commission to collect the Koran?", "a": ["Mu'awiyah ibn Abu Sufyan", "I'll go to Ibn Thabit", "Ali ibn Abu Talib", "Ubay ibn Ka'bu"], "c": 1},
  {"id": "q15", "q": "What is remarkable about the last two verses of Surah At-Tauba (Laqad Jaakum)?", "a": ["They were found written only with Abu Khuzayma ibn Thabit, and his testimony was accepted as two", "They are preserved only in Hafsa's scrolls", "Only Huzaifa knew them", "They are usually read before a battle"], "c": 0},
  {"id": "q16", "q": "Which of these names of Allah in the Qur'an is used only for Allah and not for creation?", "a": ["Ar-Rahman", "Ar-Rahim", "As-Sami'", "As-Salam"], "c": 0},
  {"id": "q17", "q": "Allah has a hundred mercies. How many of them did He leave on earth, and how many did He keep with Himself until the Day of Judgment?", "a": ["All 100 on Judgment Day", "50–50", "1–99", "99–1"], "c": 2},
  {"id": "q18", "q": "Complete the hadith: “Each ummah had its own characteristic feature. A characteristic feature of my ummah is...”", "a": ["Generosity", "Shyness", "Justice", "Sincerity in business"], "c": 1},
  {"id": "q19", "q": "What is an article of faith?", "a": ["Akida", "Iqama", "Mak'ama", "Sarida"], "c": 0},
  {"id": "q20", "q": "What is the name in Islam for the time equal to half the interval from Maghrib (sunset) to Fajr (true dawn)?", "a": ["Midnight", "Tahajjud night time", "Time between Fajr and sunrise", "Beginning of the first third of the night"], "c": 0},
  {"id": "q21", "q": "What is a religious-legal school in Islam?", "a": ["Manhaj", "Musalla", "Madhab", "Bushido"], "c": 2},
  {"id": "q22", "q": "Which sura begins with the last part of the Quran, revealed only to the Prophet ﷺ?", "a": ["\"Amma\"", "\"Al-Mulk\"", "\"As-Saja\"", "\"Kaf\""], "c": 3},
  {"id": "q23", "q": "A person who breaks an oath must feed 10 poor people. What is this atonement called?", "a": ["Isti'aza", "Tauba", "Camphor", "Kaffara"], "c": 3},
  {"id": "q24", "q": "Fleeing from the battlefield is...", "a": ["Tactical maneuver", "Big sin", "Misleading the enemy", "Minor sin"], "c": 1},
  {"id": "q25", "q": "What is the entrance to prayer and the exit from it?", "a": ["Takbir and tahlil", "Takbir and tahmid", "Takbir and taslim", "Takbir and tasbih"], "c": 2},
  {"id": "q26", "q": "Jalsat al-istiraha is a short sitting after sajda while standing up. If a person, out of forgetfulness, sat in this position longer than usual, what should he do?", "a": ["Makes two additional bows before salam", "Does nothing and ends the prayer as usual", "Reads the prayer again", "There is no such posture in prayer"], "c": 0},
  {"id": "q27", "q": "According to the majority of scholars, how many prostration verses (sujud at-tilawah) are in the Qur'an?", "a": ["7", "3", "15", "19"], "c": 2},
  {"id": "q28", "q": "According to the Hanafi madhhab, what is the legal status of congregational prayer for men?", "a": ["Wajib", "Sunnah", "Fard kifaya", "Nafl"], "c": 0},
  {"id": "q29", "q": "What is the minimum number of people required to perform congregational prayer?", "a": ["4 people", "3 people", "2 people", "1 person, as angels and jinn from among Muslims stand behind him"], "c": 2},
  {"id": "q30", "q": "A person wants to go to collective prayer in a mosque, but his creditor is there and he cannot repay his debt. Is this considered a valid reason not to go to the mosque?", "a": ["No, because all the mosques might be empty in this case", "Yes, this is a valid reason"], "c": 1},
  {"id": "q31", "q": "A Muslim recognizes the obligation of zakat, but does not pay it out of greed. What is its status in Islam?", "a": ["He will still be considered a Muslim", "He will be considered an apostate"], "c": 0},
  {"id": "q32", "q": "Complete the hadith: “The best food is that food...”.", "a": ["Which is good for the body", "Obtained from the enemy", "Free", "Which is earned with your own hands"], "c": 3},
  {"id": "q33", "q": "Which obligatory prayer is the fourth in time during the day?", "a": ["Asr", "Fajr", "Maghreb", "Isha"], "c": 2},
  {"id": "q34", "q": "Which name of Makkah is mentioned in the Qur'an (3:96)?", "a": ["Bacca", "Dhaka", "Macca", "Buthan"], "c": 0},
  {"id": "q35", "q": "In the book “Sharh al-Sira”, Ibn Abdul-Barr claims that the migration of the Prophet ﷺ to Medina after the ascension occurred through...?", "a": ["8 months", "1 year and 2 months", "6 months", "11 years old"], "c": 1},
  {"id": "q36", "q": "How many verses are there in the Qur'an about Allah's ascension to the Throne?", "a": ["9", "7", "5", "1"], "c": 1},
  {"id": "q37", "q": "Surah Al-Baqarah, verses 58–59: Allah ordered to say “hitta” (forgive us), and they said “hinta” (wheat), for which they were punished. Who are they?", "a": ["Pre-Islamic Meccans", "Jews", "Adita", "Sabii"], "c": 1},
  {"id": "q38", "q": "10th century, Cordoba, Andalusia: which madhhab was practiced in Spain?", "a": ["Hanafi", "Maliki", "Shafi'i", "Hanbali"], "c": 1},
  {"id": "q39", "q": "Sura 3:37: Every time Zakaria (alayhis salaam) entered her prayer room, he found food from her. To the question “Oh Maryam! Where did you get this from? she replied: “This is from Allah.” What is the name of this miracle?", "a": ["Mujiza", "Karamat", "There's no difference between them"], "c": 1},
  {"id": "q40", "q": "Which tribe from Yemen stopped at the spring of Zamzam with the permission of the Hajars?", "a": ["Himyar", "Hassan", "Jurkhum", "Qakhtan"], "c": 2},
  {"id": "q41", "q": "In the pre-Islamic era, what idol did the Arabs have on the shores of the Red Sea?", "a": ["Al Lat", "Al-Uzza", "Al-Manat"], "c": 2},
  {"id": "q42", "q": "The sun had long since deviated from its zenith, and the shadow of the object had almost reached its length. What is the prayer time?", "a": ["Asr", "Spirit", "Zuhr", "Maghreb"], "c": 2},
  {"id": "q43", "q": "The imam performed namaz, placing one person on his left and another on his right. Will such prayer be permissible?", "a": ["No it won't", "Yes it will", "There will be a condition if they are women"], "c": 1},
  {"id": "q44", "q": "What is a dog?", "a": ["Hunting dog", "Horse racing", "Prize", "Archery"], "c": 2},
  {"id": "q45", "q": "What is Hiba?", "a": ["Gift", "Loan", "Warranty", "Alienation"], "c": 0},
  {"id": "q46", "q": "In the hadiths about hijama (cupping), preferred days of the month are mentioned. Which?", "a": ["17th, 19th and 21st", "14th, 15th and 16th", "1st, 10th and 20th", "Any odd day"], "c": 0},
  {"id": "q47", "q": "According to the hadith of al-Bukhari, Allah accelerates the punishment in this world for two: the oppressor and the one who...", "a": ["Shows disrespect for neighbors", "Weighs on scales to merchants", "Shows disrespect towards parents", "Perjures"], "c": 2},
  {"id": "q48", "q": "From the hadith: whoever washes his head and body on the day of Juma, goes out early, catches the sermon, walks and not on horseback, and listens to the imam without being distracted - he will receive a reward for every step...", "a": ["Forgiveness of last week's sins", "Forgiveness of one sin and elevation by one step", "For fasting and praying for a whole year", "Forgiveness of sins for the past and next week"], "c": 2},
  {"id": "q49", "q": "Whoever learns the first 10 verses of this surah will be protected from the turmoil of the Dajjal. What sura are we talking about?", "a": ["\"At-Tauba\"", "\"Kaf\"", "\"As-Saja\"", "\"Al-Kahf\""], "c": 3},
  {"id": "q50", "q": "According to the hadith, whoever recites this surah on Fridays will be endowed with light on the Day of Judgment. What sura are we talking about?", "a": ["\"At-Tauba\"", "\"Al-Kahf\"", "\"As-Saja\"", "\"Kaf\""], "c": 1},
  {"id": "q51", "q": "According to the hadith, this world is given for temporary use, and the best of it is...", "a": ["Righteous friend", "Righteous neighbor", "Righteous parents", "Righteous Wife"], "c": 3},
  {"id": "q52", "q": "From the hadith: whoever in a day combines four deeds — visits the sick, attends a funeral, fasts and ... — will be written among the people of Paradise. What is the fourth deed?", "a": ["Performs Duha prayer", "Gave charity", "Goes to Friday prayers", "Dug a well"], "c": 1},
  {"id": "q53", "q": "From the hadith: In the place of Al-Muhammas, the Prophet ﷺ performed this prayer with the ascetics and said that it was offered to those who came before you, but they neglected it, and you are given a double reward for treating it with care. What kind of prayer is this?", "a": ["Spirit", "Tahajjud", "Asr", "Vitr"], "c": 2},
  {"id": "q54", "q": "From Aisha (radiyallahu anha): If Allah desires good for a house, then He bestows on its inhabitants...", "a": ["Understanding religion", "Health", "Softness", "Patience"], "c": 2},
  {"id": "q55", "q": "According to the hadith, the inhabitants of Paradise will fill 120 rows. How many of them will be Muslims?", "a": ["80 rows", "50 rows", "40 rows", "114 rows"], "c": 0},
  {"id": "q56", "q": "From the hadith: Friday prayer is obligatory for everyone except four: women, children, the sick and.... Who's fourth?", "a": ["Old people", "Merchants", "Hadji", "Slaves"], "c": 3},
  {"id": "q57", "q": "From the hadith: The width of my reservoir will be from the place where I stand to .... Complete the hadith.", "a": ["Damascus", "Alexandria", "Amman", "Nejd"], "c": 2},
  {"id": "q58", "q": "According to the hadith, what is jihad of the old man, the child, the weak and the woman?", "a": ["Hajj and Umrah", "Tahajjud", "Complete reading of the Qur'an", "Providing ammunition for those going to jihad"], "c": 0},
  {"id": "q59", "q": "From the hadith: On the Day of Judgment, when the scholars are brought to the Throne of Allah, ... will confidently walk ahead of them. Who is this?", "a": ["Ibn Abbas (radiyallahu anhu)", "Mu'adh ibn Jabal (radiyallahu anhu)", "Ibn Mas'ud (radiyallahu anhu)", "Ubay ibn Ka'b (radiyallahu anhu)"], "c": 1},
  {"id": "q60", "q": "Raising hands in prayer with takbir: after ruku'a, before sazhda and when standing up after tashahhud. What's the reward?", "a": ["10 good deeds", "Elevation by one degree in Paradise", "Erasing petty sins", "One good deed"], "c": 0},
  {"id": "q61", "q": "When standing up after the first tashahhud, takbir and raising of hands are performed...", "a": ["Sitting before standing", "While getting up", "After straightening in qiyam", "There's no difference"], "c": 1},
  {"id": "q62", "q": "Is it permissible to raise hands between two sujuds?", "a": ["Allowed", "No, it is not allowed (not established in the Sunnah)", "Only Shiites do this"], "c": 1},
  {"id": "q63", "q": "The Koran is divided into Juz, Hizb and Rub'a. How many rub'a are in the Koran? Rub'a are marked with an asterisk at the beginning of the verse.", "a": ["90", "120", "180", "240"], "c": 3},
  {"id": "q64", "q": "Voluntary prayer (nafl), performed where people cannot see it, is superior to prayer in front of people...", "a": ["2 times", "4 times", "25 times", "27 times"], "c": 2},
  {"id": "q65", "q": "From the hadith: A hypocrite will not combine two qualities - commendable religiosity and...", "a": ["Khushu‘", "Honesty", "Fiqh", "Justice"], "c": 2},
  {"id": "q66", "q": "Complete the hadith: “Everyone who is rude, ..., proud will end up in Hell.”", "a": ["deceitful", "Breaker of oaths", "Flattering", "Greedy"], "c": 3},
  {"id": "q67", "q": "Making a religious ruling based on the inner voice is...", "a": ["Ijtihad", "Qiyas", "Istihsan", "Istinbat"], "c": 2},
  {"id": "q68", "q": "According to the Hanbali madhhab, is continuity (muwalat) a required condition for wudu?", "a": ["Yes, it is", "No, it is not"], "c": 0},
  {"id": "q69", "q": "Rububiyya, Uluhiyya and Asma wa-Sifat are parts of...", "a": ["Tawhid", "Akids", "Ihsana", "Imana"], "c": 0},
  {"id": "q70", "q": "What is Sujud al-Sahw?", "a": ["Two prostrations performed due to forgetfulness in prayer (before or after salam)", "Prostration performed when reciting certain verses of the Qur'an", "Prostration of gratitude to Allah for good news", "Prostration before rulers"], "c": 0},
  {"id": "q71", "q": "How many variants of large salavat are known?", "a": ["3", "1", "7", "5"], "c": 2},
  {"id": "q72", "q": "Which of the two expressions is correct in salawat according to the Sunnah?", "a": ["\"O Allah, bless Muhammad...\"", "“O Allah, bless our master Muhammad...”", "Both expressions refer to the Sunnah", "Expressions are equivalent, but preferable without the words “our master”"], "c": 0},
  {"id": "q73", "q": "Do the following words belong to the established form of salawat: \"to Muhammad son of Abdullah\", \"Seal of the Prophets\", \"Imam of the God-fearing\", \"Messenger of Mercy\"?", "a": ["Yes, all of the above expressions are sunnah", "Only the words \"Seal of the Prophets\" are sunnah", "Only \"to Muhammad son of Abdullah\" is sunnah", "These expressions are allowed but are not the established form of salawat"], "c": 3},
  {"id": "q74", "q": "According to the Hanafi madhhab, the dua qunut in witr prayer is read...", "a": ["Always", "Sometimes", "Not at all", "Only in Ramadan"], "c": 0},
  {"id": "q75", "q": "According to the Hanafi madhhab, in witr prayer the dua qunut is read...", "a": ["Before bowing", "After bowing", "Anywhere in the third rak'ah", "At the discretion of the imam"], "c": 0},
  {"id": "q76", "q": "A hadith in which one or more narrators are missing at the beginning of the isnad is called...", "a": ["Mu'allaq", "Mursal", "Maukuf", "Da'if"], "c": 0},
  {"id": "q77", "q": "When these words are spoken in the morning, Allah protects you until the evening, and in the evening until the morning from Satan. What is this?", "a": ["Dua before prayer", "Prayer for protection from Satan", "Prayer before bed", "Strengthening Faith"], "c": 1},
  {"id": "q78", "q": "The man performed the Isha prayer closer to midnight, and after the third part of the night came, he performed 11 rak'ahs. What kind of ‘ibadat is this?", "a": ["Tahajjud", "Vitr", "Qiyamu-l-layl", "Tarawih"], "c": 2},
  {"id": "q79", "q": "Which of the obligatory prayers is better to perform closer to the end of its time?", "a": ["Fajr", "‘Isha", "Zuhr", "‘Asr"], "c": 1},
  {"id": "q80", "q": "Which prayer is better to perform immediately when its time comes?", "a": ["Fajr", "Maghreb", "‘Asr", "Zuhr"], "c": 1},
  {"id": "q81", "q": "A verse was revealed about those who were killed at the well of Ma'un. What sura is it in?", "a": ["\"Al-Bakara\"", "\"Ali 'Imran\"", "\"At-Tauba\"", "There is no such verse in the Koran"], "c": 3},
  {"id": "q82", "q": "How was the prohibition of wine established in the Qur'an?", "a": ["Gradually in three stages (Al-Baqarah 2:219, An-Nisa 4:43, Al-Maida 5:90-91)", "By a single verse", "By two verses", "There is no prohibition in the Qur'an"], "c": 0},
  {"id": "q83", "q": "A person performs Hajj without ihram, wearing simple clothes. Will his Hajj count?", "a": ["There will be", "No it won't", "There will be a condition of atonement for this sin", "Will be valid, but greatly reduced in reward"], "c": 2},
  {"id": "q84", "q": "In what century did a separate science of interpretation of the Koran emerge, the founders of which were at-Tabari and Ibn Abu Hatim?", "a": ["In the 7th century", "In the 8th century", "In the 9th century", "In the 10th century"], "c": 3},
  {"id": "q85", "q": "Al-Bukhari (from Umm Shariq, radilahu anha): The Prophet ﷺ ordered the killing of lizards because they fanned the fire of Ibrahim (alayhis salaam). What kind of lizard are we talking about?", "a": ["Varan", "Iguana", "frilled lizard", "gecko"], "c": 3},
  {"id": "q86", "q": "Al-As ibn Wail ground the bone into powder and said to the Prophet ﷺ: “Will Allah really revive this after death?” And then the last verses of the sura were revealed...", "a": ["\"Al-Bakara\"", "\"Al-Hashr\"", "\"Ya-Sin\"", "\"An-Naml\""], "c": 2},
  {"id": "q87", "q": "According to the Cairo edition of the Koran, how many Meccan and Madinan suras are there?", "a": ["80 — 34", "82 — 32", "85 — 29", "86 — 28"], "c": 3},
  {"id": "q88", "q": "“For those who believed and did righteous deeds, there is no sin for what they ate...” - who does this verse refer to? (Al-Maida, 5:93)", "a": ["The verse has a general meaning and applies to everyone", "Ayat about the participants in the Battle of Badr", "Verse about the Jews", "About the Ansars"], "c": 1},
  {"id": "q89", "q": "How many days, according to the Qur'an, did the creation of the heavens and the earth take?", "a": ["6", "7", "8", "10"], "c": 0},
  {"id": "q90", "q": "“Today, for your sake, I have perfected your religion, completed My mercy upon you, and approved Islam as a religion for you.” Indicate the surah and verse.", "a": ["Al-Maida 5:91", "\"An-Nisa\" 4:43", "Al-Baqarah 2:219", "Al Maida 5:3"], "c": 3},
  {"id": "q91", "q": "Ibn Abbas (radiyallahu anhu) reported: when the Prophet ﷺ arrived in Medina, its inhabitants deceived each other to the extent. Then Allah sent down the sura... and they began to measure honestly.", "a": ["\"At-Takvir\" (81)", "\"'Abasa\" (80)", "\"Al-Mutaffifin\" (83)", "\"Al-Buruj\" (85)"], "c": 2},
  {"id": "q92", "q": "The name of Allah \"Al-Mubin\" means...", "a": ["Mister, patron", "Expository", "Giver of food, watcher", "Omniscient"], "c": 1},
  {"id": "q93", "q": "In the hadith about the Sirat it is said that this is the place where...", "a": ["Feet will slip", "Everyone passes without trial", "No one is afraid", "Passage is only for prophets"], "c": 0},
  {"id": "q94", "q": "Which of the following is included in the menu of the inhabitants of Hell?", "a": ["Zakkum (fruit of the tree)", "Dari‘ (thorns)", "Ghislin (pus)", "All of the above"], "c": 3},
  {"id": "q95", "q": "Reading the Koran in prayer silently, but a little louder than a whisper, is called...", "a": ["Dandana", "Vandal", "Montana", "Censer"], "c": 0},
  {"id": "q96", "q": "The name of Allah \"Al-Latif\" means...", "a": ["Self-sufficient", "Bestower", "Close", "Insightful, Kind"], "c": 3},
  {"id": "q97", "q": "What is miqat?", "a": ["The set boundaries that cannot be crossed without ihram (for Hajj and 'Umrah)", "Same as Emperor Mikado title", "Place to say \"Labbayka Allahumma Labbayk\"", "Any place in Mecca"], "c": 0},
  {"id": "q98", "q": "You are flying from Europe to Mecca. What is the name of the place of entry into ihram for Hajj and Umrah?", "a": ["Dhu-l-Khuleifa", "Jeddah", "Juhfa", "Mecca"], "c": 2},
  {"id": "q99", "q": "What is the name of the miqat for those traveling from Medina to Mecca?", "a": ["Dhu-l-Khuleifa", "Medina", "Cuba", "Zat-i-Irk"], "c": 0},
  {"id": "q100", "q": "How many mikats are there in total?", "a": ["4", "3", "5", "7"], "c": 2},
  {"id": "q101", "q": "If a person passes the miqat without ihram and does not return to it, will his pilgrimage be valid?", "a": ["No, it will not", "Yes, it will", "Yes, but he must offer expiation (dam)", "Only if he returns to the miqat and enters ihram again"], "c": 2},
  {"id": "q102", "q": "From the hadith: “Truly, whoever is endowed with ... has been given a great portion of this world and the next; support of family ties, good morals and good attitude towards neighbors revitalize villages and add life span.” What are we talking about?", "a": ["Patience", "Truthfulness", "Generosity", "Softness"], "c": 3},
  {"id": "q103", "q": "From a hadith from Anas ibn Malik (radiyallahu anhu): The Prophet ﷺ said: “Take qaylulu (a short nap), truly...”", "a": ["This gives strength to qiyamu-l-layl", "The devils do not rest during the day", "Improves health", "Jews do not like to sleep during the day"], "c": 1},
  {"id": "q104", "q": "From the hadith: “There is no problem in wealth for a God-fearing person, and health for a God-fearing person is better than wealth, and ... is one of the pleasures of this world.”", "a": ["Loving wife", "Sarida (stew)", "Pleasant aroma", "Good mood"], "c": 3},
  {"id": "q105", "q": "From the hadith: “Wet your family ties, at least...”", "a": ["Salam", "A handful of dates", "Hundred bucks", "Dua for them"], "c": 0},
  {"id": "q106", "q": "From the hadith: “Verily, on the Day of Judgment Allah will cry: Where are My neighbors?” Who are they?", "a": ["Loved each other for the sake of Allah", "Secretly giving alms", "Mosques that came to life", "Forgiven debts"], "c": 2},
  {"id": "q107", "q": "From a hadith from Abu Said and Abu Hurairah (radiyallahu anhum): “Rulers will come to you who will bring the worst people closer and will delay prayer.” What should a Muslim do?", "a": ["Don't be their helper", "Don't be a police officer", "Not to be a collector of zakat and a custodian of property", "All of the above"], "c": 3},
  {"id": "q108", "q": "It is narrated from Abu Hurairah (radiyallahu anhu) that the Prophet ﷺ said: “If someone ruled at least ten people, then on the Day of Judgment he will be brought bound, and only untie him... otherwise his oppression will destroy him.” Sahih Muslim (No. 2621). What ends the hadith?", "a": ["His softness", "His generosity", "His justice", "His severity"], "c": 2},
  {"id": "q109", "q": "“The angels will be on its edge, and ... will carry over them the Throne of your Lord” (Surah Al-Haqqa, 69:17). How many are there?", "a": ["Four", "Eight", "twelve", "Sixteen"], "c": 1},
  {"id": "q110", "q": "Whoever washes the deceased and hides what he saw on him, Allah will forgive him... once.", "a": ["3 times", "7 times", "40 times", "As much as Allah wills"], "c": 2},
  {"id": "q111", "q": "Is it permissible for a woman to bathe a deceased man and vice versa?", "a": ["No, it's not allowed", "Allowed", "It is permissible if the husband washes his wife and the wife of her husband", "Allowed only in the absence of relatives of the same sex"], "c": 2},
  {"id": "q112", "q": "If the child died in the womb before 4 months, then...", "a": ["They don't make ghusl", "Not wrapped in a shroud", "They don’t read janaza prayer", "All of the above"], "c": 3},
  {"id": "q113", "q": "How many grams of silver were equal to dirhams at the time of the Messenger of Allah ﷺ?", "a": ["3 grams", "7 grams", "9 grams", "56 grams"], "c": 0},
  {"id": "q114", "q": "The Prophet ﷺ said: “Power: its beginning is reproach, its middle is regret, and its end is ... except the one who showed justice.”", "a": ["Despair", "Loneliness", "Punishment on the Day of Judgment", "Recklessness"], "c": 2},
  {"id": "q115", "q": "The rewards for the martyr are great. Which of the following **not** applies to this hadith?", "a": ["With the first drop of blood spilled, all his sins are forgiven.", "He will be shown his place in Paradise", "He will be clothed in the robe of faith", "He will sit on a bench made of nur"], "c": 3},
  {"id": "q116", "q": "One person saw that on the gates of Paradise it was written: “Verily, sadaqah is recorded in 10-fold amount, and debt is ...”", "a": ["2 times the size", "Also 10 times larger", "18 times the size", "25 times the size"], "c": 2},
  {"id": "q117", "q": "“The first thing you will lose from your religion will be amana (trust), and the last thing will be...”", "a": ["Iman", "Post", "Prayer", "Belief in predestination"], "c": 2},
  {"id": "q118", "q": "According to the Sunnah, when entering a mosque, which foot should be placed first?", "a": ["Right foot when entering and left foot when exiting", "Right foot on entry and right foot on exit", "Left foot on entry and right foot on exit", "It makes no difference as long as you go to the mosque"], "c": 0},
  {"id": "q119", "q": "From ‘Uthman ibn ‘Affan (radiyallahu anhu): The Prophet ﷺ said that Allah brought into Paradise a person who was easy in buying and selling, and also...", "a": ["Shortened and combined prayers on the way", "He gave alms so that his left hand did not know what his right hand was doing.", "When did you lend and when did you collect it?", "Treated his neighbors well"], "c": 2},
  {"id": "q120", "q": "The Prophet ﷺ said: “The prayer of two does not rise above the head: the slave who ran away from his master until he returns, and...”", "a": ["A woman who disobeys her husband until he stops disobeying", "A person harassing a neighbor until he stops", "A person who spreads gossip until he stops", "A guardian who improperly spends the orphan's property"], "c": 0},
  {"id": "q121", "q": "The testimony of which companion did the Prophet ﷺ equate to the testimony of two men?", "a": ["Abu Bakr al-Siddiq (radiyallahu anhu)", "Zayd ibn Thabit (radiyallahu anhu)", "Khuzaima ibn Thabit (radiyallahu anhu)", "Al-Mikdam ibn Ma'diykarib (radiyAllahu anhu)"], "c": 2},
  {"id": "q122", "q": "In what century according to the Hijri did Abu al-Aswad al-Duali first begin to place vowels in the Koran?", "a": ["In the first century", "In the second century", "In the third century", "In the fourth century"], "c": 0},
  {"id": "q123", "q": "The oldest printed Quran (printing press, typesetting letters) was published at the end of the 17th century in...", "a": ["Cairo", "Kufe", "Hamburg", "London"], "c": 2},
  {"id": "q124", "q": "What surah did the Prophet ﷺ read in prayer before his departure from this world?", "a": ["\"Yasin\"", "\"An-Nasr\"", "The last verses of Surah Al-Hashr", "\"Al-Mursalat\""], "c": 3},
  {"id": "q125", "q": "Where did the Prophet ﷺ change the qibla during prayer after the revelation of the verse (Al-Baqarah 2:144)?", "a": ["In Mecca", "In Medina (Masjid Banu Salama, Masjid al-Qiblatayn)", "In the village of Quba", "In Khaybar"], "c": 1},
  {"id": "q126", "q": "How long after the Hijra was the verse about the change of the qibla revealed?", "a": ["After 12 months", "After 17 months", "After 2 years and 3 months", "After 4 years"], "c": 1},
  {"id": "q127", "q": "Before the Hijra, during bowing from the waist, Muslims crossed their hands and placed them between their knees. Who prayed like that?", "a": ["Jews", "Sabii", "Muslims before the Hijra", "Christians"], "c": 2},
  {"id": "q128", "q": "What is the position of the heels during Sujud?", "a": ["They may be open", "They can be closed", "Both statements are correct"], "c": 2},
  {"id": "q129", "q": "What is the name of the shaitan who distracts you during prayer?", "a": ["Marid", "Ifrit", "Hinzab", "Babasi"], "c": 2},
  {"id": "q130", "q": "What should be said when passing by a cemetery of non-believers?", "a": ["There is no prescribed greeting; it is better to remain silent", "We ask forgiveness for them", "Telling them that Hell awaits them", "We pronounce salawat"], "c": 0},
  {"id": "q131", "q": "Who hears the punishment in the grave?", "a": ["Only genies", "Only people", "Only other dead", "All creatures except humans and genies"], "c": 3},
  {"id": "q132", "q": "The Prophet ﷺ said: “Do not laugh excessively, for excessive laughter…”. What is he doing?", "a": ["Annoys others", "Brings disease", "Changes to sadness", "Mortifies the heart"], "c": 3},
  {"id": "q133", "q": "The inhabitants of Paradise will enter there without body hair, without beard, with eyes tinted with antimony, at the age of... years?", "a": ["18 years old", "25 years old", "33 years old", "40 years old"], "c": 2},
  {"id": "q134", "q": "The Prophet ﷺ put the dates in a vessel and gave it to Abu Hurayrah. He ate from it during the reign of all four righteous caliphs, until the soldiers... (who?) came and emptied this vessel.", "a": ["Musailima", "Sajjah", "Muawiyah", "Marwana"], "c": 3},
  {"id": "q135", "q": "Which is the Sunnah when entering a house?", "a": ["Say \"As-salamu 'alaykum\" and \"Bismillah\"", "Read Ayat al-Kursi", "Enter silently", "Say only \"Bismillah\" without salam"], "c": 0},
  {"id": "q136", "q": "Where was Caliph ‘Uthman ibn ‘Affan (radiyAllahu anhu) born?", "a": ["Medina", "Usfan", "Taif", "Mecca"], "c": 2},
  {"id": "q137", "q": "What opens the “door” to prayer?", "a": ["Azan", "Ikama", "Intent", "Takbir"], "c": 3},
  {"id": "q138", "q": "Where do the “middle” suras of the mufassal begin and end?", "a": ["Surah al-A'la - Surah al-Kafirun", "Surah al-Buruj - Surah al-Bayyina", "Surah 'Abasa - Surah Az-Zalzala", "Surah An-Naba - Surah Al-'Asr"], "c": 1},
  {"id": "q139", "q": "Which two suras are called \"Tulayain\"?", "a": ["Al-Baqarah and Al-Imran", "An-Nisa and Al-Maida", "Al-Anam and Al-A'raf", "Yunus and Hud"], "c": 2},
  {"id": "q140", "q": "Who are the people on the heights (Al-A'raf) according to the most common interpretation?", "a": ["Those whose good deeds equal their sins", "Those who went to jihad without parental permission", "Only martyrs", "Only scholars"], "c": 0},
  {"id": "q141", "q": "How will the wine of the inhabitants of Paradise be sealed? (Al-Muttaffifin, 26)", "a": ["Ginger", "Camphor", "Musk", "Aloe"], "c": 2},
  {"id": "q142", "q": "How many sons did the prophet Ismail (alaihassalam) have?", "a": ["2", "6", "8", "12"], "c": 3},
  {"id": "q143", "q": "How many years did the secret call of the Prophet ﷺ last in Mecca?", "a": ["8 months", "1.5 years", "3 years", "11 years old"], "c": 2},
  {"id": "q144", "q": "How many years did the open call of the Prophet ﷺ last in Mecca?", "a": ["10 years", "8 years", "4 years", "6 years"], "c": 0},
  {"id": "q145", "q": "Who was the first of the children to accept Islam?", "a": ["Abu Bakr al-Siddiq (radiyallahu anhu)", "Zayd ibn Harisa (radiyallahu anhu)", "Khadija (radiyallahu anha)", "'Ali ibn Abu Talib (radiyallahu anhu)"], "c": 3},
  {"id": "q146", "q": "How to understand the words: “Glorify your Lord in the evening and in the morning” (Ghafir, 55)?", "a": ["Read askars in the evening and in the morning", "Pray evening and morning", "Read the Koran", "Say tasbih, tahmid, tahlil and takbir"], "c": 1},
  {"id": "q147", "q": "Who said about the Prophet ﷺ: “This is nothing but transmitted witchcraft,” and mentioned in Al-Muddassir 74:11–26?", "a": ["Abu Jahl", "Abu Lahab", "'Urwa ibn Mas'ud", "Al-Walid ibn Al-Mughira"], "c": 3},
  {"id": "q148", "q": "What is the position of the hands when raised during takbir in prayer?", "a": ["Raise to takbir", "Raise after takbir", "Raise with takbir", "All options are related to the sunnah"], "c": 3},
  {"id": "q149", "q": "What is the minimum threshold (nisab) for theft at which the thief's hand is cut off?", "a": ["Quarter dinar", "Quarter dirham", "One dinar", "Half a dinar"], "c": 0},
  {"id": "q150", "q": "What should be done with a lost item whose owner is not found?", "a": ["Search for owner 3 years", "Search for owner 3 months", "Search for owner 1 year, then you may use it while remaining obliged to return", "No need to announce"], "c": 2},
  {"id": "q151", "q": "These two rivers have their source from Paradise. Which?", "a": ["Euphrates and Tigris", "Nile and Tiger", "Amudarya and Syrdarya", "Euphrates and Nile"], "c": 3},
  {"id": "q152", "q": "What was the origin of Prophet Ibrahim (alaihassalam)?", "a": ["Arab", "Chaldean", "Jewish", "Coptom"], "c": 1},
  {"id": "q153", "q": "In Surah At-Tawbah, verse 36 it is said: “Verily, the number of months with Allah is twelve. This was written in the Scripture on the day when Allah created the heavens and the earth.” What surah is this?", "a": ["Yasin", "At-Tawba", "Al-Sajda", "An-Naml"], "c": 1},
  {"id": "q154", "q": "Based on the words of Allah in Surah Az-Zumar 39:5 about the change of day and night, some scientists have concluded that the Earth is spherical. Which Muslim scholar put forward this hypothesis?", "a": ["Al-Biruni", "Al-Khwarizmi", "Ibn Sina (Avicenna)", "Al-Farabi"], "c": 0},
  {"id": "q155", "q": "About whom it was said: “Ask! I swear by Allah, no matter what question you ask me, I will give an answer about any verse: whether it was revealed at night or during the day, on the plain or in the mountains. He knows both the obvious and the hidden from the Qur'an\"?", "a": ["Abdullah ibn Mas'ud (radiyallahu anhu)", "Abdullah ibn Abbas (radiyallahu anhu)", "Ali ibn Abu Talib (radiyallahu anhu)", "Mu'adh ibn Jabal (radiyallahu anhu)"], "c": 2},
  {"id": "q156", "q": "Name the longest verse in the Qur'an.", "a": ["Al-Baqarah, verse 282", "Al-Muzzammil, 73:20", "An-Nur, 24:31", "Al-Baqarah, verse 102"], "c": 0},
  {"id": "q157", "q": "To whom was the Zabur revealed?", "a": ["Ibrahim (alayhassalam)", "Dawood (alaihassalam)", "Shis (alayhassalam)", "Idris (alayhassalam)"], "c": 1},
  {"id": "q158", "q": "What will come on the Day of Judgment with two eyes and a tongue and testify?", "a": ["Black Stone of Kaaba", "Surah Al-Ikhlas", "Secret alms", "Staff of the Prophet ﷺ"], "c": 0},
  {"id": "q159", "q": "Who can see an angel?", "a": ["camel", "Donkey", "Dog", "Rooster"], "c": 3},
  {"id": "q160", "q": "Where and when was the verse from Surah Al-Maida, 5:3, revealed: “Today I have perfected your religion for your sake...”?", "a": ["In Haram Mecca on the day of the capture of Mecca by Muslims", "On Friday, on Mount Arafat, during the Farewell Hajj", "In Medina, on Friday, two days before the death of the Prophet ﷺ", ""], "c": 1},
  {"id": "q161", "q": "Surah Al-Maida, verse 67: “...and Allah will protect you from...” From whom?", "a": ["Jinns", "Iblis", "People", "Dajjal"], "c": 2},
  {"id": "q162", "q": "In Surah Al-Qasas, 28:24, Musa (alaihassalam) said: “Lord! Verily, I need every good thing that You bestow upon me.” What events preceded this?", "a": ["When Musa (alayhassalam) killed an Egyptian and was afraid", "When he helped the two daughters of Shu'ayb (alayhassalam) by moving a stone from the well", "When Pharaoh gathered sorcerers to compete with Musa (alaihassalam)", "When Musa (alayhassalam) stood by the Red Sea and saw the army of Pharaoh"], "c": 1},
  {"id": "q163", "q": "According to Surah Al-Qasas, verse 24: “O Lord! Verily, I need every good thing that You bestow upon me.” What circumstances preceded this prayer of Prophet Musa (alaihassalam)?", "a": ["When he killed a Copt and got scared", "When the pharaoh gathered the sorcerers for a competition", "When he met Shuaib's two daughters and helped them at the well", "When he and the people found themselves by the sea, seeing the army of Pharaoh"], "c": 2},
  {"id": "q164", "q": "The hadith says: “During Sujud, do not be like a dog.” What do you mean?", "a": ["Don't put your elbows on the ground", "Don't whine during dua", "Don't stick out your tongue", "Don't wag your body like a dog's tail"], "c": 0},
  {"id": "q165", "q": "From the hadith: Prophet Muhammad ﷺ was granted 6 advantages over the prophets. Which of the following **isn't** included in these six?", "a": ["The words given to me are laconic, but have a broad meaning", "Allah spoke to me during Miraj", "I win through fear", "I'm allowed trophies"], "c": 1},
  {"id": "q166", "q": "Deliberately changing the Qur'anic text while reciting is...", "a": ["Forbidden; deliberate distortion of meaning can be kufr", "Considered a major sin but does not take one out of Islam", "Disliked but not a sin", "It is allowed"], "c": 0},
  {"id": "q167", "q": "What will the first people entering Paradise drink with their food?", "a": ["Wine sealed with musk", "Salsabil drink", "Wine with camphor", "Milk"], "c": 1},
  {"id": "q168", "q": "Hadith of Muslim: “Let none of you, when dying, expect anything from the Almighty and Great Allah...” - what?", "a": ["Besides the good", "Besides justice", "In addition to payment for actions", "Besides mercy"], "c": 0},
  {"id": "q169", "q": "According to the hadith: “The debt must be paid first...” What do you mean?", "a": ["First of all", "Washing the deceased", "Funeral", "Will distributions"], "c": 3},
  {"id": "q170", "q": "Hadith from al-Bara (radiyallahu anhu): “Visit the sick and accompany the janazah, for...” - why?", "a": ["The reward for this is two qirat.", "For this the reward is like Mount Uhud", "This brings the ummah together", "It reminds me of the future life"], "c": 3},
  {"id": "q171", "q": "Hadith of Ibn Majah: He who sympathizes with a Muslim in his misfortune will receive reward on the Day of Resurrection. What exactly?", "a": ["Will bestow light", "Protects from fear", "Will hide his sins from people", "Dressed in robes of piety"], "c": 3},
  {"id": "q172", "q": "Muslim: “Two things are a sign of disbelief: defamation of the origin of others and...”", "a": ["Loud lamentations for the deceased", "Indifference to the origin of one's lot", "Cursing parents", "Saying: “If it weren’t for that...”"], "c": 0},
  {"id": "q173", "q": "What is the legal status of washing the body of the deceased in Islam?", "a": ["Mubah (optional)", "Wajib for everyone personally", "Fard kifaya", "An additional benefit"], "c": 2},
  {"id": "q174", "q": "Who has the greatest right to wash the dead?", "a": ["Father", "Grandfather", "Son", "The one to whom the deceased bequeathed it"], "c": 3},
  {"id": "q175", "q": "The Meccans buried their dead with a shakk (a depression at the bottom of the grave), and the Medinans buried their dead with a lahd (a depression towards the grave). How was the Messenger of Allah ﷺ buried?", "a": ["Shackcom", "Lyakhdom", "Both are valid", "No reliable information"], "c": 1},
  {"id": "q176", "q": "Who dug the grave for the Messenger of Allah ﷺ?", "a": ["Ali ibn Abu Talib (radiyallahu anhu)", "Abu 'Ubaidah ibn al-Jarrah (radiyallahu anhu)", "Abu Talha (radiyallahu anhu)", "Zayd ibn Thabit (radiyallahu anhu)"], "c": 2},
  {"id": "q177", "q": "What do those who washed the dead need?", "a": ["Ghusl is obligatory", "Ghusl is desirable", "Enough voodoo", "Preferably voodoo"], "c": 1},
  {"id": "q178", "q": "What is the name of the hadith in the chain of which there is no companion of the Prophet ﷺ?", "a": ["Mursal", "Mudtarib", "Mu'allaq", "Ma'loul"], "c": 0},
  {"id": "q179", "q": "In the hadith: in Medina, when the adhan sounds, the shaitan runs away, emitting gases. Afterwards he returns; during iqamah he runs away again, and then stands between the person and his heart, admonishing him. How far does he run?", "a": ["Until the azan becomes inaudible", "Beyond Medina", "Half a day's journey away", "At a distance of 1.5 days travel"], "c": 3},
  {"id": "q180", "q": "Which verse is called the most fair?", "a": ["“The verse on duty” - Al-Baqarah, 282", "Ayatul-Kursi", "“Whoever has done good as an atom of dust...” - Az-Zalzala, 7–8", "The last verses of Surah Al-Baqarah"], "c": 2},
  {"id": "q181", "q": "Who is truly strong according to the words of the Prophet ﷺ?", "a": ["The one who wins in battle", "One who fasts a lot", "The one who controls his anger", "Someone who goes to the gym often"], "c": 2},
  {"id": "q182", "q": "Who does the Prophet ﷺ say is a Muslim?", "a": ["Who prays a lot", "Who reads the Koran a lot", "From whose tongue and hands are other Muslims safe?", "Who fasts a lot"], "c": 2},
  {"id": "q183", "q": "Who performed Janaza prayer over ‘Umar (radiyallahu anhu)?", "a": ["Ibn ‘Umar (radiyallahu anhu)", "Sulaikh (Suhayb) (radiyallahu anhu)", "‘Uthman (radiyallahu anhu)", "Sa'd ibn Abu Waqqas (radiyallahu anhu)"], "c": 1},
  {"id": "q184", "q": "What is the reward for the one who performs janaza prayer over a dead person in the mosque?", "a": ["Two qirats", "One carat", "No reward", "It is forbidden to bring a body into the mosque"], "c": 1},
  {"id": "q185", "q": "Who should not perform Janazah prayer on?", "a": ["Above the suicide", "Over miscarriage", "Over the unbeliever", "Above all listed"], "c": 2},
  {"id": "q186", "q": "Surah Al-Fath (48:20) says: “Allah promised you rich booty that you would capture, and granted it to you in advance...” What are we talking about?", "a": ["Lands of Shama", "Palaces of Khosrow", "Mecca and Kaaba", "Khaybar"], "c": 3},
  {"id": "q187", "q": "What tribe of Jews lived in Khaybar?", "a": ["Banu Qurayza", "Banu Nadir", "Banu Israel", "Banu Qaynuqa'"], "c": 1},
  {"id": "q188", "q": "What does the verses of Surah Al ‘Imran (131, 133) indicate regarding Heaven and Hell?", "a": ["Heaven and Hell were created before the creation of man", "They were created after man", "They will be created on the Day of Resurrection", "They will be created after the trial is completed"], "c": 0},
  {"id": "q189", "q": "Surah An-Najm (53:16) says: “The lotus was covered with that which covered it.” What do you mean?", "a": ["Golden Locust", "There's an angel on every leaf", "Its beauty is indescribable to creatures", "All listed versions are possible"], "c": 3},
  {"id": "q190", "q": "What is the state of the soul of a devout Muslim after death?", "a": ["She enters Paradise only after judgment on the Day of Judgment", "She goes to Heaven immediately after death", "She awaits her bodily resurrection in the grave", "She remains in Barzakh forever"], "c": 1},
  {"id": "q191", "q": "How many levels are there in Paradise?", "a": ["100", "As many as there are suras in the Qur'an", "The same number of verses in the Qur'an", "As many as there are juz' in the Qur'an"], "c": 0},
  {"id": "q192", "q": "If you ask Allah for Paradise, which level should you ask for (according to the hadith)?", "a": ["Al-Firdaus", "Adn", "'Illiyyun", "Sijjin"], "c": 0},
  {"id": "q193", "q": "Who is Ridwan?", "a": ["One of the angels", "One of the angels of Paradise", "Guardian of Paradise", "Dweller of Paradise among people"], "c": 2},
  {"id": "q194", "q": "What is the position of Paradise after the Day of Judgment?", "a": ["It will be completely filled with people and genies", "There will be a place in it, and Allah will create creatures to fill it.", "He will disappear after the trial", "He will become part of this land"], "c": 1},
  {"id": "q195", "q": "How many gates does Heaven have?", "a": ["6", "7", "8", "9"], "c": 2},
  {"id": "q196", "q": "Whose ummah will be the second largest in Paradise?", "a": ["Ummah ‘Isa (alayhis salam)", "Ummah Yunus (alayhis salam)", "Ummah of Musa (alayhis salam)", "Ummah Saliha (alayhis salam)"], "c": 2},
  {"id": "q197", "q": "How long is one day in Paradise?", "a": ["Like 50,000 Earth years", "Like 1000 earth years", "Like on earth", "The day will be forever, without end"], "c": 1},
  {"id": "q198", "q": "What is the name of the place where the deeds of the inhabitants of Paradise are recorded?", "a": ["‘Illiyun", "Sijin", "Lavhun-Mahfouz", "Sahifa"], "c": 0},
  {"id": "q199", "q": "How will the inhabitants of Paradise sit at the Throne of Allah on Fridays?", "a": ["By degree (prophets, martyrs, etc.)", "By how much they read the Koran", "According to who was the first to come to Juma prayer", "Based on how long the tahajjud was performed"], "c": 2},
  {"id": "q200", "q": "The hadith says that Heaven and Hell had an argument. Allah has decreed: “Paradise is you...”. What's next?", "a": ["My generosity", "My justice", "My Grace", "My forgiveness"], "c": 2},
  {"id": "q201", "q": "What will be the possession of the last one to enter Paradise?", "a": ["Like one Earth", "Like three Earths", "Like ten identical Earths", "Like a hundred Earths"], "c": 2},
  {"id": "q202", "q": "Who will be the first to open the gates of Heaven?", "a": ["Adam (alaihassalam)", "Nuh (alayhassalam)", "Ibrahim (alayhassalam)", "Muhammad ﷺ"], "c": 3},
  {"id": "q203", "q": "What is the highest pleasure in Paradise?", "a": ["Get to Firdaus", "Marry 72 Gurias", "Seeing the Face of Allah", "Have a huge palace"], "c": 2},
  {"id": "q204", "q": "What is the name of the tree in Paradise under which a rider can ride for a hundred years?", "a": ["Cuba", "Buba", "Tuba", "Lyuba"], "c": 2},
  {"id": "q205", "q": "Which four rivers are mentioned in the Qur'an as rivers of Paradise? (47:15)", "a": ["Water, milk, wine and honey", "Water, honey, vinegar and milk", "Water, wine, olive oil and milk", "Water, milk, wine and blood"], "c": 0},
  {"id": "q206", "q": "How will food be removed from the bodies of the inhabitants of Paradise?", "a": ["The smell of oud", "Camphor", "Fragrant sweat, like musk", "The smell of raikhan"], "c": 2},
  {"id": "q207", "q": "Surah Al-Insan (76:21) speaks of the clothes of the inhabitants of Paradise: “from sundus and istabraq.” What is this?", "a": ["Silk and tweed", "Silk and velvet", "Satin and brocade", "Calico and calico"], "c": 2},
  {"id": "q208", "q": "Surah Yunus (10:26) says: “For those who do good, the best and the best.” What is an \"additive\"?", "a": ["Possibility to choose any Guria", "Palace of pearls", "Opportunity to see the Face of Allah", "Save 70 relatives from Hell"], "c": 2},
  {"id": "q209", "q": "What, according to the hadith, are the houses in Paradise built of?", "a": ["Gold brick and silver brick", "Plaster of musk, earth of saffron", "Pearl and ruby stones", "All of the above are true"], "c": 3},
  {"id": "q210", "q": "What is the distance between the doors of the gates of Paradise, according to the hadith of Muslim?", "a": ["Distance of one year's journey", "Distance of three years' journey", "Distance of forty years' journey", "Distance of a hundred years' journey"], "c": 2},
  {"id": "q211", "q": "The Prophet ﷺ said: “I swear by Him in Whose Hand is the soul of Muhammad! The inhabitant of Paradise has been granted the power of... men...\"", "a": ["The power of two men", "The power of ten men", "The power of thirty-three men", "The strength of a hundred men"], "c": 3},
  {"id": "q212", "q": "What is Al-Wasila?", "a": ["Highest Degree in Paradise", "One of the degrees of Firdaus", "Private Palace in Paradise", "Name of the source in Paradise"], "c": 0},
  {"id": "q213", "q": "How many levels does Hell have?", "a": ["3 levels", "5 levels", "7 levels", "9 levels"], "c": 2},
  {"id": "q214", "q": "Jahannam, Laza, Khutama, Sa'ir, Sakar, Jahim, Hawiah - what is it?", "a": ["Female names in Arabia", "Tribes of Arabia", "Names of fruits in Sham", "Hell Level Names"], "c": 3},
  {"id": "q215", "q": "What is the meaning of the word \"Hawiyah\"?", "a": ["Abyss, chasm", "Blazing fire", "Raging fire", "Flame"], "c": 0},
  {"id": "q216", "q": "At what level of Hell will there be hypocrites (munafiks)?", "a": ["On the first", "On the third", "On the fifth", "On the seventh"], "c": 3},
  {"id": "q217", "q": "What is the name of the bridge stretched over Hell?", "a": ["Mizan", "Pirate", "Sirat", "Sesame"], "c": 2},
  {"id": "q218", "q": "What is the fuel of Hell?", "a": ["People and stones", "Firewood and coal", "Oil and gas", "Nuclear fusion"], "c": 0},
  {"id": "q219", "q": "What is the name of the tree that grows through the levels of Hell?", "a": ["Mamluk", "Temlyuk", "Zakkum", "Sakar"], "c": 2},
  {"id": "q220", "q": "What are the fruits of Zakkum like?", "a": ["On cactus fruits", "On pigs' heads", "On the heads of the devils", "On the burning embers"], "c": 2},
  {"id": "q221", "q": "What is the name of the guard of Hell?", "a": ["Alik", "Malik", "Gehenna", "Gorgon"], "c": 1},
  {"id": "q222", "q": "How many angels will hold on to each bridle when Hell is brought on Judgment Day?", "a": ["1000", "7000", "70 000", "100 000"], "c": 2},
  {"id": "q223", "q": "How many reins will Hell have when it is brought on the Day of Judgment?", "a": ["2 reins", "4 reins", "1000 bridles", "70,000 bridles"], "c": 3},
  {"id": "q224", "q": "How many angels guard Hell?", "a": ["17", "19", "1000", "70 000"], "c": 1},
  {"id": "q225", "q": "Who is the inhabitant of Hell?", "a": ["Only non-believers", "Only hypocrites", "Only Muslims whose sins outweigh their good deeds", "All these three categories"], "c": 3},
  {"id": "q226", "q": "What part of the fire of Hell is the fire that we use on earth?", "a": ["1/2", "1/12", "1/25", "1/70"], "c": 3},
  {"id": "q227", "q": "How many years will a stone thrown into Hell fall until it reaches the bottom?", "a": ["7 years", "10 years", "25 years old", "70 years old"], "c": 3},
  {"id": "q228", "q": "What color is the fire of Hell?", "a": ["Red", "White", "Black", "Crimson"], "c": 2},
  {"id": "q229", "q": "There will be a neck by the fire that will say: “Three have been entrusted to me...” Who is the third?", "a": ["Innovator", "Singing songs", "Creator of images", "Interest taker"], "c": 2},
  {"id": "q230", "q": "The Prophet ﷺ was shown Hell. What tribe was the woman from?", "a": ["Tribe of Judah", "Samud tribe", "Himyar tribe", "Tribe Jumhur"], "c": 2},
  {"id": "q231", "q": "Whoever cuts down a tree... Allah will throw him head down into the fire.", "a": ["date palm", "Miswak bush", "Lotus", "Tree on the territory of the Haram"], "c": 2},
  {"id": "q232", "q": "How many people out of every thousand will end up in Hell?", "a": ["555 out of a thousand", "666 out of a thousand", "777 out of a thousand", "999 out of a thousand"], "c": 3},
  {"id": "q233", "q": "The distance between the shoulders of a non-believer in Hell will be equal to...", "a": ["Three days' journey on foot", "Three days' journey for the horseman", "One day's journey on foot", "One day of the rider's journey"], "c": 1},
  {"id": "q234", "q": "In the hadith it says the thickness of the skin of a disbeliever will be...", "a": ["7 cubits", "42 cubits", "70 cubits", "100 cubits"], "c": 1},
  {"id": "q235", "q": "The lightest punishment in Fire...", "a": ["Cape of fire", "Izar of fire", "Cloak of Fire", "Sandals made of fire"], "c": 3},
  {"id": "q236", "q": "Verily, the inhabitants of Fire will weep...", "a": ["Boiling water", "Salty tears", "Blood"], "c": 2},
  {"id": "q237", "q": "On the Day of Judgment the Sun and Moon will...", "a": ["Will disappear", "Will become witnesses", "Twisted in fire", "Closed within a mile"], "c": 2},
  {"id": "q238", "q": "What are the two conditions for deeds to be accepted in Islam?", "a": ["Sincerity for Allah and conformity to the Sunnah", "Many deeds and publicity", "Noble lineage and wealth", "Intention alone without following the Sunnah"], "c": 0},
  {"id": "q239", "q": "What is *harj*?", "a": ["Adultery", "Loss of amanat", "Murders", "Perjury"], "c": 2},
  {"id": "q240", "q": "\"The land of the Arabs again...\"", "a": ["Will not be empty of people", "will not be conquered", "Will not be covered with greenery and rivers", "Will not worship idols"], "c": 2},
  {"id": "q241", "q": "The time will come only when...", "a": ["The worst people will remain on earth", "The Nile will change course", "Quds Force will be destroyed", "The ground will collapse in Sham"], "c": 0},
  {"id": "q242", "q": "\"I was sent...\" (hadith about the nearness of the Hour). What is correct?", "a": ["...with the approach of this Hour", "...with the blowing of this Hour", "...with the delay of this Hour", "...with the destruction of this Hour"], "c": 0},
  {"id": "q243", "q": "Who was called Banu al-Asfar?", "a": ["Yementsev", "Persov", "Byzantines", "Residents of Taif"], "c": 2},
  {"id": "q244", "q": "How many liars will appear?", "a": ["20", "30", "40", "70"], "c": 1},
  {"id": "q245", "q": "What does \"red treasury\" mean?", "a": ["Land of Shama", "Mountains of Persia", "Byzantium", "Khosrow"], "c": 2},
  {"id": "q246", "q": "What destroys Islam?", "a": ["Scientists' mistakes", "Hypocrites' Controversy", "Resolutions of imams", "Everything said is true"], "c": 3},
  {"id": "q247", "q": "The Prophet ﷺ said: the omen of this Hour will be the disappearance of knowledge, the rooting of ignorance, people will drink a lot of wine, and it will become widespread...", "a": ["Adultery", "Murders", "Property theft", "Perjury"], "c": 0},
  {"id": "q248", "q": "The false prophet Musailima was killed under Abu Bakr (radiyallahu anhu). Who killed him?", "a": ["‘Ali (radiyallahu anhu)", "‘Umar (radiyallahu anhu)", "Vakhshi (radiyallahu anhu)", "Al-A'mash"], "c": 2},
  {"id": "q249", "q": "The Hour of Judgment will not come until time is shortened. A year will become like a month, a month like a week, a week like a day, a day like an hour, and an hour like...", "a": ["The time of two rak'ats of the sunnah before Fajr", "The disappearance of the evening dawn after the Maghreb", "The smoldering time of the firebrand", "Camel milking time"], "c": 2},
  {"id": "q250", "q": "The Messenger of Allah ﷺ said: “The Hour of Judgment will not come until those passing by the graves speak...”", "a": ["“May Allah have mercy on him, he does not see what we see”", "“It would be better if I were in his place”", "“Allah saved them from the trials to which we are subjected”", "“As-salamu ‘alaikum, inhabitants of the graves. May Allah have mercy on you and on us who join you.\""], "c": 1},
  {"id": "q251", "q": "There is disagreement about the children of polytheists. According to one strong opinion, what will happen to them on the Day of Judgment?", "a": ["They will be tested", "They will enter Paradise without testing", "They will be servants of the people of Paradise"], "c": 0},
  {"id": "q252", "q": "As-Sahih 2315. It is narrated from ‘Abdullah ibn ‘Amr (radiyallahu anhu) that the Prophet ﷺ said: “The one who is entrusted with property for safekeeping is not responsible for it if...”", "a": ["It is cheaper than one dinar", "It's been there for over a year", "Something happened to him through no fault of his own.", "The owner of the property died"], "c": 2},
  {"id": "q253", "q": "Sahih 2639. From ‘Abdullah ibn ‘Amr (radiyallahu anhu) it is reported that the Prophet ﷺ said: “The best type of sadaq is...”", "a": ["Secret sadaka", "Sadaqah to your family", "Visiting a sick person", "Reconciliation of people"], "c": 3},
  {"id": "q254", "q": "Which of the following remembrances is authentically established after the obligatory prayer?", "a": ["\"Astaghfirullah\" (3 times), then \"Allahumma anta as-Salamu wa minka as-Salam...\"", "\"Allahumma Rabbana atina fid-dunya hasana...\"", "A long personal dua with raised hands after every fard", "There is no prescribed dhikr after fard"], "c": 0},
  {"id": "q255", "q": "After completing the prayer, which ‘ibadat is considered the best?", "a": ["Reading the Quran", "Sunnat prayer (2 rak'ahs)", "Raise of hands and long sincere dua", "Tasbih"], "c": 3},
  {"id": "q256", "q": "Wiping your face with your hands after completing dua - is this sunnah?", "a": ["Yes, it's sunnah", "No, this is not sunnah"], "c": 1},
  {"id": "q257", "q": "The patient was in very serious condition. The Prophet ﷺ asked: “What is the matter with you?” He replied: “I asked Allah to punish me in this world.” The Prophet ﷺ said: “Speak...” and the words from verse Al-Baqarah 2:201 were revealed. Which?", "a": ["“O Allah! You are the healer - heal me, truly there is no healing except Yours.\"", "“La ilakha illya Anta, subhanaka, inni kuntu minaz-zalimin”", "“Allahumma, Rabbana atina fid-dunya hasana wa fil-ahirati hasana wa kina ‘azaba-n-Nar”", "“The hearts of believers are comforted and healed by the remembrance of Allah”"], "c": 2},
  {"id": "q258", "q": "What should you say to the person who said to you: “May Allah forgive you!” (Gafar-Allah laka!)", "a": ["Amin", "Shukra (thank you)", "Wow! (and may Allah forgive you too)", "Give him a ruble"], "c": 2},
  {"id": "q259", "q": "The Prophet ﷺ said: “O people! Repent to Allah, verily I bring repentance to Him... once a day.”", "a": ["80 times", "100 times", "150 times", "1000 times"], "c": 1},
  {"id": "q260", "q": "The Prophet ﷺ said: “Whoever says ten times:\n“La ilaha illa-Llahu wahdahu la sharika lahu, la-hul-mulku wa la-hul-hamdu wa huwa ‘ala kulli shai’in kadir”\n- he’s like...”", "a": ["To the one who freed three of the descendants of Ismail", "Four", "Ten", "Seventy"], "c": 1},
  {"id": "q261", "q": "What is the sunnah ruling for someone who performs night prayer with wudu made in the evening?", "a": ["It is permissible and recommended to keep one's wudu", "It is disliked", "It is forbidden", "It is permissible only when ill"], "c": 0},
  {"id": "q262", "q": "What did the words of the prophet Ibrahim (alaihis salam) say to Ismail’s wife mean: “Tell him to strengthen the threshold of his door”?", "a": ["Let him divorce his wife", "The door is shaky because of the threshold", "Let him strengthen his marriage with his wife", "—"], "c": 2},
  {"id": "q263", "q": "Surah Al-Hujurat (49), verse 12: “...And do not seek out...”. What are we talking about?", "a": ["About controlling your thoughts", "Be positive", "Don't spy on others, looking for their flaws.", "Control the words"], "c": 2},
  {"id": "q264", "q": "Surah Yusuf, verse 87: “Indeed, no one loses hope in the mercy of Allah except the disbelievers.” Is it losing hope?", "a": ["Undesirable", "Minor sin", "Big sin", "Quitting Religion"], "c": 2},
  {"id": "q265", "q": "In Medina there lived a man named Abu Juhaina. He had two measuring cups: with one he measured, and with the other he asked to measure for him. On his occasion, verses 1–3 of Surah “The Weighers” (Al-Mutaffifin) were revealed. What is this sin?", "a": ["This is reprehensible", "Minor sin", "Big sin", "Not a sin at all"], "c": 2},
  {"id": "q266", "q": "A long hadith states that the Prophet ﷺ said: “O ‘Abbas! Oh uncle! Should I give you a gift? -What gift are we talking about?", "a": ["About the announcement of Paradise", "Taught him how to make dua Qunut", "Freed him from captivity after Badr", "Taught him the Tasbih prayer"], "c": 3},
  {"id": "q267", "q": "According to hadiths, is it forbidden to withhold surplus water (when others need it)?", "a": ["Yes, it is forbidden", "No, it is allowed", "It is disliked but not forbidden", "Only if the water was purchased"], "c": 0},
  {"id": "q268", "q": "The hadith about the hypocrite states three qualities, but there is a hadith with a fourth. Call this additional quality.", "a": ["Avid debater", "Adulterer", "Liar", "Dayus (he doesn't care what the family does)"], "c": 0},
  {"id": "q269", "q": "Musnad Ahmad 3138. Abu Huraira reported that the Prophet ﷺ said:\n“Whoever listens carefully to one verse of the Qur'an is written down... which will be multiplied.\nAnd for the one who reads aloud, it will become a light for him on the Day of Judgment.”", "a": ["One good deed", "10 good deeds", "1 good deed for each letter", "10 good deeds for each letter"], "c": 0},
  {"id": "q270", "q": "Silsila al-Sahiha 549. Musnad Ahmad 6/21.\nFadala ibn Ubayd narrated that the Messenger of Allah ﷺ said during the farewell Hajj:\n\"Mu'min is the one...\"", "a": ["Who is zealous in worshiping Allah", "Who fulfills all five pillars of Islam", "Who recognizes the six pillars of Iman", "Who do people trust with their property and lives?"], "c": 3},
  {"id": "q271", "q": "From the hadith of Fadal ibn Ubaid that the Messenger of Allah ﷺ said:\n\"Muslim is the one...\"", "a": ["Who gave two testimonies", "Who recites the five obligatory prayers?", "Who was born into a Muslim family", "Who does not harm people with his tongue or hands"], "c": 3},
  {"id": "q272", "q": "From the hadith of Fadal ibn Ubaid that the Messenger of Allah ﷺ said:\n\"Mujahid is the one...\"", "a": ["Who fights in the path of Allah", "Who fights with his soul to submit to Allah", "Who defends his life, honor and property", "Who submitted to the Muslim ruler"], "c": 1},
  {"id": "q273", "q": "From the hadith of Fadal ibn Ubaid that the Messenger of Allah ﷺ said:\n“And the muhajir is the one...”", "a": ["Who moved", "Who moved to Medina", "Who forsook sins", "Who migrated in the path of Allah"], "c": 2},
  {"id": "q274", "q": "Sahih al-Jami' al-Saghir 868.\nAccording to Anas ibn Malik, the Messenger of Allah ﷺ said:\n“The most merciful in my ummah is...”", "a": ["Abu Bakr al-Siddiq", "Uthman bin 'Affan", "‘Ali", "‘Abdur-Rahman bin ‘Awf"], "c": 0},
  {"id": "q275", "q": "According to Anas ibn Malik, the Messenger of Allah ﷺ said:\n“The best judge in my ummah is...”", "a": ["Mu'adh ibn Jabal", "‘Ali ibn Abu Talib", "‘Umar ibn Khattab", "Abu 'Ubaidah ibn al-Jarrah"], "c": 1},
  {"id": "q276", "q": "According to Anas ibn Malik, the Messenger of Allah ﷺ said:\n“He knows best what is forbidden and what is permitted...”", "a": ["Ubay ibn Ka'b", "‘Umar ibn Khattab", "Mu'adh ibn Jabal", "Az-Zubair"], "c": 2},
  {"id": "q277", "q": "According to Anas ibn Malik, the Messenger of Allah ﷺ said:\n“He knows inheritance issues best of all...”", "a": ["Ubay ibn Ka'b", "Abu Talha", "Zayd ibn Thabit", "Khuzaima ibn Thabit"], "c": 2},
  {"id": "q278", "q": "According to Anas ibn Malik, the Messenger of Allah ﷺ said:\n\"The best reciter of the Qur'an is...\"", "a": ["Zayd ibn Harisa", "‘Abdur-Rahman bin ‘Awf", "Ibn Mas'ud", "Ubay ibn Ka'b"], "c": 3},
  {"id": "q279", "q": "According to Anas ibn Malik, the Messenger of Allah ﷺ said:\n“Each community had its own confidant, and the confidant of my community is...”", "a": ["‘Abdur-Rahman bin ‘Awf", "Sa'd ibn Mu'adh", "Abu 'Ubaidah ibn al-Jarrah", "‘Amr ibn al-‘As"], "c": 2},
  {"id": "q280", "q": "As-Silsilya as-Sahiha 2831.\n“Indeed, the servant of Allah will be rewarded for everything he spends, except what he spends on...”", "a": ["Accumulation of wealth", "Hijama", "Horse racing", "Construction"], "c": 3},
  {"id": "q281", "q": "A person performed ‘Isha prayer in a mosque with a jamaat, came home without talking to anyone and, without communicating with his household, immediately performed 4 rakats of nafl prayer (ratiba) with one tashahhud. What's the reward?", "a": ["How to free 10 slaves from the sons of Ismail", "As if he was fasting on the day of 'Arafat", "As if he was praying on the night of Laylat al-Qadr", "Forgiveness of 7 big sins"], "c": 2},
  {"id": "q282", "q": "At the beginning of the prophecy, the Battle of Bu'as took place in Yathrib between two tribes. Between whom?", "a": ["Aus and Quraiza", "Nadir and Khazraj", "Aus and Khazraj", "Quraysh and Mudar"], "c": 2},
  {"id": "q283", "q": "12 years after the beginning of the prophecy, 12 people from Yathrib (10 from Khazraj and 2 from Aus) met with Muhammad ﷺ, who accepted Islam and took an oath. Why is this called the first oath of Aqaba?", "a": ["Aqaba is a valley near Mecca", "This was the name of the well near the road from Medina to Mecca", "This is a large tamarisk tree, which was given the name Aqaba", "This is the name of the hill"], "c": 3},
  {"id": "q284", "q": "How many times did the Messenger of Allah ﷺ perform Hajj?", "a": ["1 time", "2 times", "3 times", "Repeatedly before and after the Hijri"], "c": 0},
  {"id": "q285", "q": "At the time of accepting Islam, what religion did Salman al-Farisi adhere to?", "a": ["Paganism", "Zoroastrianism", "Christianity"], "c": 2},
  {"id": "q286", "q": "Surah An-Nur, verses 11-21, were revealed about this woman. Who is she?", "a": ["Khadija", "Asia", "Zainab bint Jahsh", "Aisha"], "c": 3},
  {"id": "q287", "q": "In the 5th year of the Hijri, she participated with the Prophet ﷺ in the battle of Banu Mustaliq, known as the Mureisi Campaign. Who is she?", "a": ["Aisha", "Maimuna", "Juwayriyah", "Hawsa"], "c": 0},
  {"id": "q288", "q": "Is this al-hukm?", "a": ["Reason", "Norm", "Sign", "Base"], "c": 1},
  {"id": "q289", "q": "Morning askars can only be read...?", "a": ["From Fajr time until dawn", "From Fajr until sunrise", "From Fajr to the zenith of the sun", "From the Zeitgeist to Zuhr"], "c": 2},
  {"id": "q290", "q": "Evening askaras can only be read...?", "a": ["From zuhr to 'isha", "From 'Asr to Maghrib", "From 'asra to 'isha", "From Maghrib to 'Isha"], "c": 2},
  {"id": "q291", "q": "In the khutbah it is said: \"The worst matters are ...\". What is meant?", "a": ["Innovations in religion", "Lie", "Slander", "Disobedience to parents"], "c": 0},
  {"id": "q292", "q": "From the hadith: prayer in the Quba mosque is like...?", "a": ["Traveler's prayer", "Prayer at Al-Quds Mosque", "Prayer in my mosque", "Die"], "c": 3},
  {"id": "q293", "q": "Where was Masjid ad-Dirar (Mosque of Unbelief) built?", "a": ["In Medina", "On the road to Khaybar", "Cuba‘", "In the territory of Banu Qaynuqa"], "c": 2},
  {"id": "q294", "q": "What objects are allowed by Sharia law to kiss?", "a": ["Place of prayer of Ibrahim (maqam of Ibrahim)", "Tomb of the Prophet Muhammad ﷺ", "Black Stone (al-Hajar al-Aswad)", "All of the above can be kissed"], "c": 2},
  {"id": "q295", "q": "In the pre-Islamic era, the Aus and Khazraj tribes performed Hajj to this idol. Which one?", "a": ["Al Lat", "Al-‘Uzza", "Al-Manat"], "c": 2},
  {"id": "q296", "q": "Are the terms \"tawhid\" and \"shahada\" synonyms?", "a": ["No, they are different concepts", "Yes, they are synonyms", "They are antonyms", "They are homonyms"], "c": 0},
  {"id": "q297", "q": "Which surah is second in length (by number of verses) after Al-Baqarah?", "a": ["Ali 'Imran", "An-Nisa", "Ash-Shu'ara", "Al-Maida"], "c": 0},
  {"id": "q298", "q": "Is it permissible for the imam in the mosque to combine and shorten prayers if it is raining outside?", "a": ["Allowed", "Allowed to shorten", "Allowed to combine"], "c": 2},
  {"id": "q299", "q": "Is it permissible to give zakat under the category of fi ar-riqab (freeing slaves/mukatab)?", "a": ["Yes, it is", "No, it is not"], "c": 0},
  {"id": "q300", "q": "Is it permissible for freedmen of the family of Muhammad ﷺ to receive zakat?", "a": ["He has the right to zakat", "He has no right to zakat"], "c": 1},
  {"id": "q301", "q": "Who is a miskin in Sharia?", "a": ["A person who has some means but not enough for basic needs", "A person with no property or income at all", "A person with enough for a year", "A person with two wives"], "c": 0},
  {"id": "q302", "q": "In which surah is the splitting of the moon mentioned?", "a": ["Al-Qamar", "Al-Buruj", "Al-Inshiqaq", "Az-Zalzalah"], "c": 0},
  {"id": "q303", "q": "What is the name of the madhhab, which was written down and systematized by the disciples of the imam - Abu Yusuf and Muhammad?", "a": ["Hanafi", "Maliki", "Shafi'i", "Ahmad"], "c": 0},
  {"id": "q304", "q": "One Jew said to the Prophet ﷺ: “Are you making shirk by saying: “Allah and you have said,” and also...?”", "a": ["Wear amulets", "Throw arrows", "Swear by the Kaaba", "Guess by the flight of birds"], "c": 2},
  {"id": "q305", "q": "Who is a faqir (poor person) in Sharia?", "a": ["A person who does not have enough for basic needs", "A person with half the required means", "A person with a year's food supply", "A person with wealth above nisab"], "c": 0},
  {"id": "q306", "q": "“No one was endowed with a better gift than...” (Muslim 1053). What do you mean?", "a": ["Softness", "Justice", "Humility", "Patience"], "c": 3},
  {"id": "q307", "q": "From the hadith: one man confessed his love to the Prophet ﷺ for the sake of Allah. What did the Prophet ﷺ answer him?", "a": ["Get ready for the good news", "Prepare to be poor", "May Allah love you", "You will be next to me in Paradise"], "c": 1},
  {"id": "q308", "q": "At one of the following events, Iblis groaned. Under what?", "a": ["When Musa and his people crossed the sea", "When Ibrahim threw a stone at him when they met in Mecca", "When Muhammad ﷺ became a prophet with the revelation of Surah Al-‘Alaq", "When was Surah Al-Fatihah revealed?"], "c": 3},
  {"id": "q309", "q": "Sura 2 “Al-Baqarah”, verse 102. In what area did the two angels Harut and Marut teach people witchcraft?", "a": ["In Babylon", "In Jerusalem", "In Damascus", "In Mesopotamia, in the city of Ur"], "c": 0},
  {"id": "q310", "q": "Surah An-Nisa (Women), verse 51: “...They believe in jibt and taghut...”. What is Jibt according to Hassan al-Basri?", "a": ["Amulet", "Tree hung with rags", "stone", "Echo of Shaitan"], "c": 3},
  {"id": "q311", "q": "Sura 2 “Al-Baqarah”, verse 102. What is the longest place in this verse in the Quran?", "a": ["1st place", "2nd place", "3rd place", "4th place"], "c": 3},
  {"id": "q312", "q": "The hadiths report a group that survived and stood by the truth until the Day of Judgment. It is reported from Abu Umama that he was asked: “Where will they be, O Messenger of Allah ﷺ?” What did he say?", "a": ["At my mosque", "At the Kaaba", "At the Holy House (Beit al-Maqdis)", "Wherever Allah wills"], "c": 2},
  {"id": "q313", "q": "A man found a treasure of gold in his garden. Should he pay tax on it?", "a": ["Yes, I owe 20%", "Yes, owe 50%", "Determines the nisab and pays zakat from it", "Don't owe anyone anything"], "c": 0},
  {"id": "q314", "q": "According to Ibn Mas'ud, which verse is the most voluminous in meaning in the Qur'an?", "a": ["Ayat al-Kursi", "Surah An-Nakhl 16:90 - “Verily, Allah commands to observe justice and do good...”", "Surah At-Talaq 65:3 - “Whoever fears Allah, He creates a way out...”", "Surah Az-Zumar 39:53 - “Do not despair of Allah’s mercy”"], "c": 1},
  {"id": "q315", "q": "One of the women asked ‘Aisha: “Which person has the greatest right over me?” She replied: “Your husband.” Then she asked: “Who has more rights to her husband?” What did 'Aisha answer?", "a": ["You have", "In your children", "At his father's", "At his mother's"], "c": 3},
  {"id": "q316", "q": "When was the marriage between the Messenger of Allah ﷺ and Sawda bint Zam'a concluded?", "a": ["Three years before the Hijri", "One year before the Hijri", "Immediately after the Hijra", "Two years after the Hijra"], "c": 0},
  {"id": "q317", "q": "In the hadith about the seven major sins, indicate a sin that is not included in this hadith.", "a": ["Eating the orphan's property", "Arrogance", "Accusation of a chaste woman", "Usury"], "c": 1},
  {"id": "q318", "q": "Name the first sin by which creation disobeyed Allah.", "a": ["Fakhr (pride)", "Quiet (arrogance)", "Kibr (arrogance)", "Ujb (complacency)"], "c": 2},
  {"id": "q319", "q": "What is the kaffarah for zihar according to the Qur'an (58:3-4)?", "a": ["Free a slave; if unable, fast two months; if unable, feed 60 poor people", "Fast for three days or feed 10 poor people", "Only tawbah (repentance)", "Ask your wife for forgiveness"], "c": 0},
  {"id": "q320", "q": "The hadith says: “Tuba for the one who saw me and believed... and another Tuba for the one who...?”", "a": ["Who renounced great sins", "Who spends their nights in worship", "Who reconciled two warring hearts", "Who believed in me without seeing me"], "c": 3},
  {"id": "q321", "q": "Tuba is a tree in Paradise: its flowers are covers, its leaves are aba. What are its branches made of?", "a": ["Oud", "Amber", "Musk", "Salsabil"], "c": 1},
  {"id": "q322", "q": "In a hadith, the Prophet ﷺ said: “Should I inform you of what is more dangerous and scary for you than al-Masih ad-Dajjal?” What is this?", "a": ["Witchcraft", "Usury", "Hidden Shirk", "Killing a Muslim without right"], "c": 2},
  {"id": "q323", "q": "A man found 100 kg of honey in a hollow tree in the forest. What is the tax on what is found?", "a": ["1/5 part (20 kg)", "1/2 part (50 kg)", "Determines the nisab and pays according to it", "Don't owe anyone anything"], "c": 0},
  {"id": "q324", "q": "Jamaat prayer. The imam is in ruku', and the one standing behind is still in qiyam. How many positions can you lag behind the imam?", "a": ["Not for any position", "For one position", "For two positions", "For three positions"], "c": 2},
  {"id": "q325", "q": "When did Hawsa bint ‘Umar become the wife of the Messenger of Allah ﷺ?", "a": ["1 year before Hijri", "In 1 year Hijri", "In the 3rd year of the Hijra", "In the 5th year of the Hijri"], "c": 2},
  {"id": "q326", "q": "Which of these wives did the Messenger of Allah ﷺ bury with his own hands?", "a": ["Sauda", "Umm Salama", "Zainab bint Khuzaimah", "Maimuna"], "c": 2},
  {"id": "q327", "q": "How many times is the name of Allah \"Al-Ahad\" mentioned in the Qur'an?", "a": ["One time", "Three times", "Nine times", "Seventeen times"], "c": 0},
  {"id": "q328", "q": "Which of these names of Allah are always mentioned in pairs?", "a": ["Al-Ahad and Al-Wahid", "Ar-Rahman and Ar-Rahim", "Al-Malikul-Mulk and Al-Malik", "Al-Awwal and Al-Akhir"], "c": 3},
  {"id": "q329", "q": "Surah At-Tawbah 9:70. Which prophet was sent to the people of 'Ad?", "a": ["Hood", "Salih", "Shu'ayb", "Idris"], "c": 0},
  {"id": "q330", "q": "Muslim 2642: “This is speedy good news for the believer.” What did the Messenger of Allah ﷺ mean?", "a": ["Azan, call to prayer", "Disease", "Marriage proposal", "A good deed for which people praise him"], "c": 3},
  {"id": "q331", "q": "According to Ibn Mas'ud: patience is half of faith, and complete faith is...?", "a": ["Ikhlas (sincerity)", "Tawakkul (hope)", "Yakin (conviction)", "Khushu‘ (humility)"], "c": 2},
  {"id": "q332", "q": "‘Aria is a thing taken for temporary use in fiqh. What did the Messenger of Allah ﷺ take from Safwan ibn Umayya on the day of the Battle of Hunayn?", "a": ["Shield", "Spear and helmet", "Horse", "Chainmail"], "c": 3},
  {"id": "q333", "q": "Sulh in Arabic is reconciliation...?", "a": ["Between spouses", "Between warring groups", "In a property dispute between two parties", "All of the above"], "c": 3},
  {"id": "q334", "q": "How many main types of naskh (abrogation) are identified in 'ulum al-Qur'an?", "a": ["1", "2", "3", "4"], "c": 2},
  {"id": "q335", "q": "How did the Messenger of Allah ﷺ know the end of a particular surah?", "a": ["By the revelation of the basmallah", "Jibril informed him", "Through inspiration"], "c": 0},
  {"id": "q336", "q": "Which of the companions had the suras in the order in which we read the Koran today?", "a": ["Scrolls of 'Ali ibn Abu Talib", "Scrolls of Ubayy ibn Ka'b", "Scrolls of 'Uthman ibn 'Affan"], "c": 2},
  {"id": "q337", "q": "Which of the following titles is the book of Allah?", "a": ["Koran", "Furqan", "Kitab", "Dhikr (Reminder)", "Tanzil (Sent Down)", "All of the above means the book of Allah"], "c": 5},
  {"id": "q338", "q": "During mi'raj, in which sky did the Messenger of Allah ﷺ meet the prophets 'Isa and Yahya (peace be upon them)?", "a": ["In the second sky", "In the third heaven", "On the fourth heaven", "On the fifth heaven"], "c": 0},
  {"id": "q339", "q": "Sura 17 “Al-Isra”, verse 57: “Those to whom they call in prayer themselves seek closeness to their Lord...” Who are we talking about?", "a": ["About people who worship the righteous", "About those who worship dead ancestors", "About those who worship jinn", "About idol worshipers"], "c": 2},
  {"id": "q340", "q": "Which of the wives of the Messenger of Allah ﷺ died last?", "a": ["‘Aisha", "Hawsa", "Maimuna", "Umm Salama"], "c": 3},
  {"id": "q341", "q": "She married the Messenger of Allah ﷺ in the year 7 AH, and the mediator in the marriage was Najashi (the ruler of Ethiopia). Who is she?", "a": ["Umm Salama", "Ramla bint Abu Sufyan (Umm Habiba)", "Maimuna", "Maria"], "c": 1},
  {"id": "q342", "q": "Before the battle, this prophet looked at the sun and said: “You are forced and I am forced. O Allah, delay it for me a little.\" Who are we talking about?", "a": ["Yusha' ibn Nun", "Dhul-Qarnain", "Ilyas", "Musa"], "c": 0},
  {"id": "q343", "q": "Which group was the first Muslim to break away from Islam?", "a": ["Mu'tazilites", "Kharijites", "Rafidhi", "Shiites"], "c": 1},
  {"id": "q344", "q": "The four entered the Kaaba and each of them performed prayer, turning in a different direction. Which one of them chose the correct direction of the qibla?", "a": ["The one who turned towards Jerusalem", "The one who turned to the Black Stone", "The one who turned to the Yemen wall", "They all chose the right direction"], "c": 3},
  {"id": "q345", "q": "Jamaat prayer. The imam, out of forgetfulness, rises to the fifth rak'ah. The one standing behind knows that this is the fifth rak'ah. What is its effect?", "a": ["He rises after the imam", "He remains sitting"], "c": 1},
  {"id": "q346", "q": "She was called \"the luckiest old woman.\" She married her daughters to the most eminent men of her time, and one of her daughters married the Messenger of Allah ﷺ and died in the same place where she married him. Who is she?", "a": ["Hind bint 'Awf", "Khadija رضي الله عنها", "Maimuna رضي الله عنها", "Safiyya رضي الله عنها"], "c": 0},
  {"id": "q347", "q": "The seller (farmer) takes money from the buyer against the future harvest. What is the position of such a transaction in Shariah?", "a": ["She is allowed", "She is not allowed"], "c": 0},
  {"id": "q348", "q": "He was born in 810 and died in 870. Author of the books “Al-Jami‘ al-Sahih”, “At-Tarikh al-Kabir”, “Al-Adab al-Mufrad”. Who is this?", "a": ["Muslim", "Al-Bukhari", "At-Tirmidhi", "An-Nasai"], "c": 1},
  {"id": "q349", "q": "At-Tirmidhi 3317. According to the hadith, between the seventh heaven and the Throne there is water. What is the distance from its bottom to the surface?", "a": ["100 years of journey", "300 years of journey", "500 years of journey", "700 years of journey"], "c": 2},
  {"id": "q350", "q": "In what year of the Hijri did the plague known as the Amawas plague begin in Sham, under the reign of 'Umar ibn al-Khattab?", "a": ["13 AH", "15 AH", "18 AH", "21 AH"], "c": 2},
  {"id": "q351", "q": "Who read the funeral prayer over ‘Ali ibn Abu Talib?", "a": ["Hasan ibn 'Ali", "Hussein ibn 'Ali", "Abdullah ibn Ja'far", "Khuzaima ibn Thabit"], "c": 0},
  {"id": "q352", "q": "According to Ibn ‘Abbas: the interpretation of the Koran is divided into several sections. How many are there?", "a": ["1", "2", "3", "4"], "c": 3},
  {"id": "q353", "q": "What is the zakat on the fruits of plants that were irrigated with rainwater and groundwater?", "a": ["2.5 %", "10 %", "5 %", "20 %"], "c": 1},
  {"id": "q354", "q": "Were hadith written during the life of the Messenger of Allah ﷺ?", "a": ["Yes, some companions wrote them with his permission", "No, writing hadith was completely forbidden", "There is no authentic report of writing hadith", "They were written only after the Prophet's death"], "c": 0},
  {"id": "q355", "q": "At the beginning of Islam, where did the largest number of Qur'anic scholars die?", "a": ["At the well of Bir Ma'un", "At the Battle of Muta", "At the Battle of Yamama", "At the Battle of Uhud"], "c": 2},
  {"id": "q356", "q": "How was the Qur'an sent down to the nearest sky?", "a": ["It was revealed in several parts", "He was revealed in parts over a period of 23 years", "He was sent down immediately and completely"], "c": 2},
  {"id": "q357", "q": "The science called Islamic exegesis is the science of...?", "a": ["Interpretation of the Koran", "Interpretation of hadiths", "Jinnah", "Islamic law"], "c": 0},
  {"id": "q358", "q": "The Jew Dhu Nuwas in 523 attempted to convert Christians to Judaism by digging a ditch and burning them in a fire. Which sura of the Koran describes this event?", "a": ["Al-Inshiqaq", "Al-Burouj", "Al-Gashiya", "Az-Zalzala"], "c": 1},
  {"id": "q359", "q": "There is a rule in Sharia: “Everything is prohibited in ibadah except what is permitted.” What is the situation in everyday matters?", "a": ["Everything is prohibited except what is permitted.", "Everything that is not prohibited is permitted"], "c": 1},
  {"id": "q360", "q": "Surah Al-Fil (The Elephant) describes Abraha's campaign from Yemen to Mecca. What religion did he follow?", "a": ["Sabianism", "Judaism", "Christianity", "Paganism"], "c": 2},
  {"id": "q361", "q": "Silsilah al-Sahiha 231. The Messenger of Allah ﷺ said: “Carrying out one of Allah’s punishments is better than rain falling for ... days on Allah’s earth.” How many days?", "a": ["3 days", "7 days", "30 days", "40 days"], "c": 3},
  {"id": "q362", "q": "If a person commits a crime unintentionally, is the payment of diya also imposed on his next of kin?", "a": ["No, it is not assigned", "Yes, it is assigned"], "c": 1},
  {"id": "q363", "q": "According to the Shafi'i madhhab, what is the amount of diya for a Christian or Jew (ahl al-dhimma) killed by accident?", "a": ["Equal to a Muslim's diya", "Half of a Muslim's diya", "No diya is due except for a Muslim"], "c": 1},
  {"id": "q364", "q": "Of the wives and concubines of the Messenger of Allah ﷺ, how many of them were maidens?", "a": ["7", "5", "3", "1"], "c": 3},
  {"id": "q365", "q": "The wives of the Prophet ﷺ are the mothers of the faithful. For committing a virtue or a sin, did they receive reward and punishment in the same way as other Muslim women, or did they have a special degree?", "a": ["They received double reward and double punishment", "They got ten times more", "Up to seven hundred times more", "There was no difference from other Muslim women"], "c": 0},
  {"id": "q366", "q": "Musa (peace be upon him) delivered a sermon that softened hearts. When asked who has the greatest knowledge on earth, he answered: “I.” Allah pointed him to a slave who had great knowledge. Who was it?", "a": ["Idris", "Ilyas", "Yunus", "Khidr"], "c": 3},
  {"id": "q367", "q": "Surah Ya Sin describes the story of three messengers who arrived in the city. Who are they?", "a": ["Nothing is known about them", "They were from among the followers of Musa", "They were messengers of 'Isa", "They were from the Sabians"], "c": 0},
  {"id": "q368", "q": "From the hadith: “Knowledge is better than worship, but at its core lies...” What does this mean?", "a": ["Patience", "Perseverance", "Piety", "Empty stomach"], "c": 2},
  {"id": "q369", "q": "Ijara is...?", "a": ["Tree from the fig family", "Property lease agreement with option to buy", "Property rental agreement"], "c": 2},
  {"id": "q370", "q": "Mudaraba is...?", "a": ["Loan agreement", "Lease agreement", "Agreement on the provision and management of capital"], "c": 2},
  {"id": "q371", "q": "In Sharia, a person is considered a scientist...?", "a": ["About whom other scholars have testified that he is a scholar, can give fatwas and knowledge is taken from him", "Who memorized the Koran and Hadith", "If he holds the position of qadi", "If he has an Islamic education"], "c": 0},
  {"id": "q372", "q": "Bukhari and Muslim: The Messenger of Allah ﷺ said: “Learn the Qur'an from four: Ibn Mas'ud, Ubay ibn Ka'b, Mu'adh ibn Jabal and...” Who's fourth?", "a": ["‘Ali ibn Abu Talib", "Zayd ibn Thabit", "Salim, freedman of Abu Huzaifa", "'Abdullah ibn 'Abbas"], "c": 2},
  {"id": "q373", "q": "Imam Malik said: “I did not give a fatwa until... people from among those with knowledge testified that I was worthy of it.” How many people was it?", "a": ["3", "7", "40", "70"], "c": 3},
  {"id": "q374", "q": "The man sneezed and said: “Alhamdulillah rabbil-‘alamin.” Is this expression consistent with the sunnah?", "a": ["This is an innovation", "This is the sunnah"], "c": 1},
  {"id": "q375", "q": "A man went out to visit a sick man in the morning. What is his reward?", "a": ["70,000 angels will ask for him until the evening", "Forgiveness of major sins", "Freeing Ten Slaves", "On this day he himself will not get sick"], "c": 0},
  {"id": "q376", "q": "After the oath of the second ‘Aqaba, when the treaty of the Prophet ﷺ was concluded with the Aus and Khazraj tribes, the shaitan rose to a hill and shouted to warn the Meccans. What was his name?", "a": ["Hinzab", "Azab", "Maarid", "Lyosha"], "c": 1},
  {"id": "q377", "q": "In the 4th year of the Hijra, a Muslim army of about 1,500 people set out on a campaign, and an enemy army of about 2,000 people came out to meet them. What was the name of this trip?", "a": ["Zat ar-Rika'", "Second Badr", "‘Usfan", "Trekking to Taif"], "c": 1},
  {"id": "q378", "q": "Which two prayers are described as the hardest for hypocrites?", "a": ["Fajr and 'Isha", "Zuhr and Asr", "Maghrib and Duha", "Witr and Tahajjud"], "c": 0},
  {"id": "q379", "q": "Ribat is the protection of the borders of Muslims, as well as the anticipation of the next prayer in the mosque. Which of the following also violates ribat along with talking and breaking wudu?", "a": ["Loud laughter", "Crossing fingers", "Short nap", "Sorting pebbles in the mosque"], "c": 1},
  {"id": "q380", "q": "Which side of the rows (in congregational prayer) receives the blessing of Allah and the angels?", "a": ["The right side", "The left side", "Only the spots immediately behind the imam", "The reward is the same for everyone"], "c": 0},
  {"id": "q381", "q": "The hadith says: “Take care of this Quran, for, by Him in Whose Hand is the soul of Muhammad, it is slipping away faster than...” What is the comparison?", "a": ["How do the firebrands of an extinguished fire burn out?", "How the dawn disappears", "How does a camel free itself from its bonds?", "How does the morning dew disappear?"], "c": 2},
  {"id": "q382", "q": "Complete the hadith: “The deeds of the one who deliberately leaves prayer will become in vain...”", "a": ["Fajr", "Asr", "Maghreb", "‘Isha"], "c": 1},
  {"id": "q383", "q": "The hadith says: “I was ordered to bow to the ground, leaning on ... parts of the body,” and the Prophet ﷺ pointed to them, and also forbade picking up clothes and hair. How many parts is this?", "a": ["5", "7", "9", "8"], "c": 1},
  {"id": "q384", "q": "A man has a slave. A slave has property: a house, a car and other property. The owner decided to sell the slave. Does all the property of a slave pass to the new owner?", "a": ["Yes, he's moving on", "No, it doesn't go", "Half of the property is transferred"], "c": 1},
  {"id": "q385", "q": "A person lent an amount exceeding the nisab. The debtor is unable to repay the debt. Who is responsible for paying zakat?", "a": ["On the person who borrowed", "On the person who lent", "On no one", "On both"], "c": 2},
  {"id": "q386", "q": "How many letters are in the Arabic alphabet?", "a": ["25", "27", "28", "31"], "c": 2},
  {"id": "q387", "q": "How many basic short vowel sounds (harakat) are there in Arabic?", "a": ["2", "3", "4", "5"], "c": 1}
]
